src/Documents/РА_ПодсистемаРасчетаБонусовПартнеров_НачислениеБонусовПартнерам/РА_ПодсистемаРасчетаБонусовПартнеров_НачислениеБонусовПартнерам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РА_ПодсистемаРасчетаБонусовПартнеров_НачислениеБонусовПартнерам</name>
  <registerRecords>AccumulationRegister.РА_ПодсистемаРасчетаБонусовПартнеров_БонусыПартнерам</registerRecords>
  <attributes>
    <name>ДатаПриложенияКДоговору</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НеИзменятьАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПриложенияКДоговору</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодДействия</name>
    <type>
      <types>CatalogRef.РА_ПодсистемаРасчетаБонусовПартнеров_ПериодыДействияБонуса</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаБонусовИтого</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФиоФинДира</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредоставленыСтатДанные</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НачисленияАвтоматическийРасчет</name>
    <attributes>
      <name>АналитикаНастройкиПремий</name>
      <type>
        <types>CatalogRef.РА_ПодсистемаРасчетаБонусовПартнеров_ФорматыОтгрузки</types>
        <types>CatalogRef.РА_ПодсистемаРасчетаБонусовПартнеров_ВидыОборудованияДляНачисленияБонусов</types>
      </type>
    </attributes>
    <attributes>
      <name>БонусируемыйОборот</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>БонуснаяПрограмма</name>
      <type>
        <types>CatalogRef.РА_ПодсистемаРасчетаБонусовПартнеров_БонусныеПрограммы</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоказательЗакупки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПоказательПлана</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентВыполненияПлана</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентПремии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипПоказателяПлана</name>
      <type>
        <types>EnumRef.РА_ТипыПоказателяПлана</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипПремии</name>
      <type>
        <types>EnumRef.РА_ТипыПремийПартнерам</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НачисленияРучнойРасчет</name>
    <attributes>
      <name>АналитикаНастройкиПремий</name>
      <type>
        <types>CatalogRef.РА_ПодсистемаРасчетаБонусовПартнеров_ФорматыОтгрузки</types>
        <types>CatalogRef.РА_ПодсистемаРасчетаБонусовПартнеров_ВидыОборудованияДляНачисленияБонусов</types>
      </type>
    </attributes>
    <attributes>
      <name>БонусируемыйОборот</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>БонуснаяПрограмма</name>
      <type>
        <types>CatalogRef.РА_ПодсистемаРасчетаБонусовПартнеров_БонусныеПрограммы</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентПремии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипПремии</name>
      <type>
        <types>EnumRef.РА_ТипыПремийПартнерам</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТаблицаДействующихБонусныхПрограмм</name>
    <attributes>
      <name>БонуснаяПрограмма</name>
      <type>
        <types>CatalogRef.РА_ПодсистемаРасчетаБонусовПартнеров_БонусныеПрограммы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/CommonModules/ПриобретениеУслугПрочихАктивовЛокализация/Module.bsl
#Область СлужебныеПроцедурыИФункции

// Подсистема расчета бонусов партнеров обработка заполнения.
// 
// Параметры:
//  Объект - ДокументОбъект.ПриобретениеУслугПрочихАктивов - Объект
//  ДанныеЗаполнения - ДокументСсылка.РА_ПодсистемаРасчетаБонусовПартнеров_НачислениеБонусовПартнерам - Данные заполнения
//  СтандартнаяОбработка - Булево - Стандартная обработка
&После("ОбработкаЗаполнения")
Процедура РА_ПодсистемаРасчетаБонусовПартнеровОбработкаЗаполнения(Объект, ДанныеЗаполнения, СтандартнаяОбработка) Экспорт

	Если ТипЗнч(ДанныеЗаполнения) <> Тип(
		"ДокументСсылка.РА_ПодсистемаРасчетаБонусовПартнеров_НачислениеБонусовПартнерам") Тогда
		Возврат;
	КонецЕсли;

	РеквизитыОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеЗаполнения, "Партнер, Контрагент");

	Объект.Валюта = Константы.ВалютаРегламентированногоУчета.Получить();

	Объект.ВалютаВзаиморасчетов = Объект.Валюта;

	Объект.Партнер = РеквизитыОснования.Партнер;
	Объект.Контрагент = РеквизитыОснования.Контрагент;
		
	//Добавим значение в табличную часть документа 
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СУММА(ЗапросНачисления.СуммаБонуса) КАК СуммаБонуса,
	|	СУММА(ЗапросНачисления.СуммаНДС) КАК СуммаНДС,
	|	ЗапросНачисления.СтавкаНДС КАК СтавкаНДС
	|ИЗ
	|	(ВЫБРАТЬ
	|		РА_НачислениеБонусовПартнерамНачисленияАвтоматическийРасчет.Сумма КАК СуммаБонуса,
	|		РА_НачислениеБонусовПартнерамНачисленияАвтоматическийРасчет.СуммаНДС КАК СуммаНДС,
	|		РА_НачислениеБонусовПартнерамНачисленияАвтоматическийРасчет.СтавкаНДС КАК СтавкаНДС
	|	ИЗ
	|		Документ.РА_ПодсистемаРасчетаБонусовПартнеров_НачислениеБонусовПартнерам.НачисленияАвтоматическийРасчет КАК РА_НачислениеБонусовПартнерамНачисленияАвтоматическийРасчет
	|	ГДЕ
	|		РА_НачислениеБонусовПартнерамНачисленияАвтоматическийРасчет.Ссылка = &Основание
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РА_НачислениеБонусовПартнерамНачисленияАвтоматическийРасчет.Сумма,
	|		РА_НачислениеБонусовПартнерамНачисленияАвтоматическийРасчет.СуммаНДС,
	|		РА_НачислениеБонусовПартнерамНачисленияАвтоматическийРасчет.СтавкаНДС
	|	ИЗ
	|		Документ.РА_ПодсистемаРасчетаБонусовПартнеров_НачислениеБонусовПартнерам.НачисленияРучнойРасчет КАК РА_НачислениеБонусовПартнерамНачисленияАвтоматическийРасчет
	|	ГДЕ
	|		РА_НачислениеБонусовПартнерамНачисленияАвтоматическийРасчет.Ссылка = &Основание) КАК ЗапросНачисления
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗапросНачисления.СтавкаНДС
	|";

	Запрос.УстановитьПараметр("Основание", ДанныеЗаполнения);

	ВыборкаСтрок = Запрос.Выполнить().Выбрать();

	Пока ВыборкаСтрок.Следующий() Цикл

		СтрокаРасходы = Объект.Расходы.Добавить();
		СтрокаРасходы.Количество = 1;
		СтрокаРасходы.СтавкаНДС = ВыборкаСтрок.СтавкаНДС;
		СтрокаРасходы.Содержание = "";
		//@skip-check wrong-type-expression
		СтрокаРасходы.Сумма = ВыборкаСтрок.СуммаБонуса;
		//@skip-check wrong-type-expression
		СтрокаРасходы.СуммаСНДС = ВыборкаСтрок.СуммаБонуса + ВыборкаСтрок.СуммаНДС;

		СтрокаРасходы.СуммаНДС = ВыборкаСтрок.СуммаНДС;

		СтрокаРасходы.Цена = ВыборкаСтрок.СуммаБонуса;

	КонецЦикла;

КонецПроцедуры

#КонецОбласти
